Repository: pypi-data/pypi-mirror-275
Catalog: packages/imio.restapi/imio.restapi-1.0rc2.tar.gz/imio.restapi-1.0rc2/src/imio/restapi/locales/*/LC_MESSAGES/imio.restapi.po
Languages: fr

source: Application links
fr: Liens avec les autres applications

source: Enable debug mode?
fr: Activer le mode debug?

source: Import
fr: Importer

source: Linked element(s)
fr: Elément(s) lié(s)

source: List of application with who this application will communicate
fr: Liste des applications avec lesquelles cette application communiquera

source: Manually enable debug mode when RESTAPI_DEBUG environment variable is not set to True.
fr: Lorsque la variable d'environnement RESTAPI_DEBUG n'est pas activée, ceci permet d'activer le mode debug, les entrées/sorties des requêtes REST sont affichées dans le log de Zope

source: Return full object after creation by default?
fr: Lors de la création d'un élément, retourner une sérialisation complète de l'élément créé?

source: The application identifier
fr: L'identifiant de l'application

source: The client unique identifier
fr: L'identifiant unique du client

source: The content {title} was created
fr: Le contenu {title} a été créé

source: The content(s) was imported
fr: Le(s) contenu(s) ont été importé(s)

source: The public url of this application
fr: L'URL publique de l'application

source: The url of the Webservice instance
fr: L'URL de l'instance des webservices

source: This information is configured in the instance configuration file
fr: Cette information est configurée dans le fichier de configuration de l'instance

source: When an element is created, check the box if the full object must be returned by default (default is true)
fr: Cette information est configurée dans le fichier de configuration de l'instance<br>Lorqu'un élément est créé via les WS REST, si la case est cochée (défaut), une sérialisation complète de l'objet créé sera renvoyée au créateur Si décoché, la version "sommaire" est retournée
